app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "publishDate", "hat", "content", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "avatar" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["avatar", "avatar-1606916_640.png"], ["updated_at", "2017-06-30 14:34:16.076132"], ["id", 2]]